{
  "projects": [
    {
      "slug": "five-whys-and-a-how",
      "name": "Five Whys and a How",
      "impact": "Increased curiosity to learn and think critically over 3 weeks. More questions from kids per day.",
      "techStack": [
        "Kotlin 2.0",
        "Jetpack Compose",
        "Material 3",
        "Firebase AI (Gemini)",
        "Firebase Auth",
        "Supabase\tStorage",
        "PostgreSQL database",
        "REST API"
      ],
      "githubUrl": "https://github.com/VaibhavSrivastava-777/Y5",
      "category": "AI/ML",
      "date": "2026-02-05",
      "description": "Y5 Kids Learning is an Android app for children aged 6–18 that combines three learning modes: Math Practice offers flexible arithmetic drills with immediate feedback; 5 Whys develops critical thinking through age-appropriate, step-by-step exploration of facts across science and social studies, with AI-generated illustrations; Question Paper Generation converts uploaded PDFs into personalized practice tests. Built with Kotlin, Jetpack Compose, and Firebase AI (Gemini 2.5 Flash), the app includes comprehensive progress tracking with visual charts to motivate learners and demonstrate improvement over time.",
      "star": {
        "content": "<h2>Situation</h2><p>School-going children aged 6–18 needed an engaging, comprehensive learning tool that could address multiple educational needs: fundamental math skills practice, critical thinking development, and exam preparation using their own study materials. Traditional learning apps often focused on single subject areas and lacked personalization, failing to leverage students' existing educational resources or provide integrated progress tracking across different learning modes.</p><h2>Task</h2><p>Develop an Android application that would:</p><ul><li>Provide adaptive math practice covering core arithmetic operations (addition, subtraction, multiplication, division) with immediate feedback</li><li>Foster critical thinking skills through structured \"5 Whys\" analysis suitable for various age groups</li><li>Enable personalized exam preparation by converting uploaded PDF study materials into practice question papers</li><li>Track learning progress across all modules to motivate continuous improvement</li><li>Deliver an intuitive, age-appropriate user experience using modern Android development practices</li></ul><h2>Action</h2><p><strong>Architecture &amp; Technology Selection:</strong></p><ul><li>Built the app using Kotlin 2.0 with Jetpack Compose and Material 3 for a modern, declarative UI</li><li>Integrated Firebase AI (Gemini 2.5 Flash) for intelligent content generation and age-appropriate explanations</li><li>Implemented Supabase backend (PostgreSQL, Storage, PostgREST) for scalable data management</li><li>Used Firebase Auth with anonymous authentication for frictionless user onboarding</li><li>Deployed Vico charting library for visual progress tracking</li><li>Integrated PdfBox-Android for PDF processing and Ktor client for network operations</li><li>Targeted Android SDK 24–35 for broad device compatibility</li></ul><p><strong>Feature Implementation:</strong></p><p><em>Math Practice Module:</em></p><ul><li>Developed flexible practice sessions with 3-digit arithmetic across all four operations</li><li>Created configurable question counts (5, 10, or 20 questions) and mixed operation modes</li><li>Implemented immediate visual feedback system (green for correct, red for incorrect with correct answer displayed)</li><li>Designed custom numeric keyboard optimized for math input</li><li>Built progress indicator and performance-based feedback messaging (e.g., \"Great job!\" for 80%+ accuracy)</li></ul><p><em>5 Whys Critical Thinking Module:</em></p><ul><li>Designed flashcard-style flow guiding users through root-cause analysis</li><li>Implemented age-appropriate explanation generation (tailored for 6–18 age range)</li><li>Created smooth transitions between sequential \"why\" levels</li><li>Integrated optional AI-generated illustrations to enhance understanding</li><li>Built topic coverage spanning science (physics, chemistry, biology) and social studies (history, civics, geography, economics)</li><li>Developed fact carousel with example prompts to inspire user inquiry</li><li>Added connected fun facts to encourage further exploration</li></ul><p><em>Question Paper Generation:</em></p><ul><li>Built PDF upload and parsing functionality to extract content from textbooks and notes</li><li>Implemented AI-powered question generation focused on medium-to-hard difficulty levels</li><li>Created personalized test generation that reuses students' existing study materials</li><li>Designed question paper interface for exam-like practice experience</li></ul><p><em>Progress Tracking System:</em></p><ul><li>Developed comprehensive score history tracking for both math and question-paper sessions</li><li>Implemented visual charts showing improvement trends over time</li><li>Created motivational feedback based on progress metrics</li></ul><h2>Result</h2><p>Successfully launched Y5 Kids Learning (package: com.y51h.students) as a comprehensive Android learning platform that:</p><ul><li><strong>Unified multiple learning modes</strong> into a single app, eliminating the need for separate tools for math practice, critical thinking, and exam preparation</li><li><strong>Personalized the learning experience</strong> by transforming students' own PDF materials into practice tests, making study more relevant and efficient</li><li><strong>Made learning measurable</strong> through integrated progress tracking with visual charts, enabling students and parents to see concrete improvement over time</li><li><strong>Leveraged modern AI capabilities</strong> to provide age-appropriate explanations, generate illustrations, and create meaningful questions from uploaded content</li><li><strong>Delivered immediate feedback</strong> in math practice, reinforcing learning and maintaining engagement through visual cues and encouraging messages</li><li><strong>Fostered critical thinking</strong> through the structured 5 Whys methodology, helping students develop analytical skills beyond rote memorization</li><li><strong>Maintained technical excellence</strong> using cutting-edge Android development practices (Kotlin 2.0, Jetpack Compose, Material 3) for a smooth, responsive user experience</li></ul><p>The app successfully addresses the educational needs of a broad age range (6–18) while providing parents and educators with visibility into student progress across multiple learning dimensions.</p>",
        "situation": "",
        "task": "",
        "action": "",
        "result": ""
      }
    }
  ]
}